Перем ssl, HTTPСоединение;
Перем Токен, Куки;
Перем ДанныеФизЛица, ТекстДляОтправки, Статус;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.РезультатПолученияИНН.Заголовок = "Данные еще не получены";
	Элементы.РезультатПолученияИНН.Подсказка = "";
	Элементы.РезультатПолученияИНН.Гиперссылка = Ложь;	

	ТекстДляОтправки = ОбновитьДанныеФизЛицаСервер();
	
	Элементы.РезультатПолученияИНН.Заголовок = "Текущий ИНН: " + СсылкаНаОбъект.ТекущийИНН;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеФизЛицаСервер()
	
		
	Если СсылкаНаОбъект.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК Серия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК Номер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК Вид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.ИНН КАК ТекущийИНН,
	|	ПОДСТРОКА(ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия, 1, 2) + ""+"" + ВЫБОР
	|		КОГДА ПОДСТРОКА(ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия, 3, 1) = "" ""
	|			ТОГДА ПОДСТРОКА(ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия, 4, 2)
	|		ИНАЧЕ ПОДСТРОКА(ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия, 3, 2)
	|	КОНЕЦ + ""+"" + ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК СерияНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.КодИМНС КАК КодИМНС
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	ДанныеФизЛица = Запрос.Выполнить().Выбрать();
	
	Если ДанныеФизЛица.Следующий() Тогда 
		ТекстДляОтправки = "c=innMy"
		+ "&fam=" + КодироватьСтроку(ДанныеФизЛица.Фамилия,СпособКодированияСтроки.КодировкаURL)
		+ "&nam=" + КодироватьСтроку(ДанныеФизЛица.Имя,СпособКодированияСтроки.КодировкаURL)
		+ ?(ЗначениеЗаполнено(ДанныеФизЛица.Отчество),
		"&otch=" + КодироватьСтроку(ДанныеФизЛица.Отчество,СпособКодированияСтроки.КодировкаURL),
		"&opt_otch=1"
		)
		+ "&bdate="+ Формат(ДанныеФизЛица.ДатаРождения,"ДЛФ=Д")
		+ "&doctype=" + ДанныеФизЛица.КодИМНС
		+ "&docno=" + ДанныеФизЛица.СерияНомер
		+ "&docdt=" + Формат(ДанныеФизЛица.ДатаВыдачи,"ДЛФ=Д"); 
		
		Возврат ТекстДляОтправки;
			
	Иначе
		ТекстДляОтправки = "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПолучитьИНН()
	
	Если СсылкаНаОбъект.Пустая() Тогда
		Сообщить("Не указано физлицо");
		Возврат;
	ИначеЕсли ТекстДляОтправки = "" Тогда
		Сообщить("Нет данных о паспорте и ФИО физлица");
		Возврат;
	ИначеЕсли Статус = 1 ИЛИ Статус = 2 Тогда
		//ИНН получен или есть ошибки
		Возврат;
	КонецЕсли;		
	
	//Отправим данные и получим ИНН	
	ТекстФормы = ТекстДляОтправки + "&captcha=" + Капча + "&captchaToken=" + Токен;	
	
	ЗаголовокHTTP = Новый Соответствие();	
	ЗаголовокHTTP.Вставить("Accept","application/json, text/javascript, */*; q=0.01");
	ЗаголовокHTTP.Вставить("X-Requested-With","XMLHttpRequest");
	ЗаголовокHTTP.Вставить("Content-Type","application/x-www-form-urlencoded");
	ЗаголовокHTTP.Вставить("Cookie","JSESSIONID=" + Куки);	
	
	HTTPЗапрос = Новый HTTPЗапрос("/inn-proc.do",ЗаголовокHTTP);	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстФормы,КодировкаТекста.ANSI);	
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Результат = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
	
	ТекстСообщенияПользователю = "";
	ТекстПодсказки = "";	
	
	//Поищем результат операции
	ПоложениеКод = Найти(Результат,"""code""");	
	Если ПоложениеКод = 0 Тогда
		//Есть ошибки
		Статус = 2;
		ЭлементыФормы.РезультатПолученияИНН.ЦветТекста = WebЦвета.Красный;
		//Нужно вывести все записи в [] скобках
		ПозицияСкобкиЛево = Найти(Результат,"[");
		Пока ПозицияСкобкиЛево <> 0 Цикл
			ПозицияСкобкиПраво = Найти(Результат,"]");
			ТекстСообщенияПользователю = Сред(Результат,ПозицияСкобкиЛево+1,ПозицияСкобкиПраво-ПозицияСкобкиЛево-1);
			ТекстПодсказки = ТекстПодсказки + ТекстСообщенияПользователю + Символы.ПС;
			Результат = Прав(Результат,СтрДлина(Результат) - ПозицияСкобкиПраво);			
			ПозицияСкобкиЛево = Найти(Результат,"[");
		КонецЦикла;
		ОбновитьКартинку();
		Капча = "";
	ИначеЕсли Сред(Результат,ПоложениеКод+7,1) = "0" Тогда
		//Нет данных
		Статус = 3;
		ЭлементыФормы.РезультатПолученияИНН.ЦветТекста = WebЦвета.Красный;
		ТекстСообщенияПользователю = "По указанным Вами сведениям в ФБД ЕГРН не найден ИНН";
		ТекстПодсказки = ТекстДляОтправки;
	ИначеЕсли Сред(Результат,ПоложениеКод+7,1) = "3" Тогда
		//Нет данных
		Статус = 3;
		ЭлементыФормы.РезультатПолученияИНН.ЦветТекста = WebЦвета.Красный;
		ТекстСообщенияПользователю = "Указанные Вами сведения не прошли однозначной идентификации по ФБД ЕГРН";
		ТекстПодсказки = ТекстДляОтправки;
	Иначе
		Статус = 1;
		ЭлементыФормы.РезультатПолученияИНН.ЦветТекста = WebЦвета.Зеленый;
		ПоложениеИНН = Найти(Результат,"""inn""");
		ИНН = Сред(Результат,ПоложениеИНН+7,12);
		Если ДанныеФизЛица.ТекущийИНН = ИНН Тогда
			ТекстПодсказки = "ИНН уже заполнен: " + ИНН;
		Иначе
			ТекстПодсказки = "ИНН изменился: " + ДанныеФизЛица.ТекущийИНН + "->" + ИНН;
		КонецЕсли;
		ТекстСообщенияПользователю = ИНН;
	КонецЕсли;

	ЭлементыФормы.РезультатПолученияИНН.Заголовок = ТекстСообщенияПользователю;
	ЭлементыФормы.РезультатПолученияИНН.Подсказка = ТекстПодсказки;
	ЭлементыФормы.РезультатПолученияИНН.Гиперссылка = Статус = 1;
	
	HTTPЗапрос = Неопределено;	
	
КонецПроцедуры

ssl = Новый ЗащищенноеСоединениеOpenSSL(
Новый СертификатКлиентаWindows(),
Новый СертификатыУдостоверяющихЦентровWindows());	

ssl4 = Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено );

HTTPСоединение = Новый HTTPСоединение("service.nalog.ru",,,,,,ssl4);

ТекстДляОтправки = ""; Статус = 0;

